Repository: Nitrokey/nitrokey-storage-update-boot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: de

source: Connected device: {} 0.{}
de: Angeschlossenes Gerät: {} 0.{}

source: Executing system shutdown in {SHUTDOWN_DELAY} seconds.
de: Systemabschaltung in {SHUTDOWN_DELAY} Sekunden durchführen.

source: Once PC is powered off, please remove the USB flash drive to prevent another boot of the tool.
de: Nach dem Ausschalten des PCs entfernen Sie bitte den USB-Stick, um einen erneuten Start des Tools zu verhindern.

source: Executing system shutdown.
de: Systemabschaltung durchführen.

source: CTRL+C registered. Calling system shutdown.
de: STRG+C registriert. Ich rufe die Systemabschaltung an.

source: Successfully enabled the update mode. Please run the Nitrokey Update Tool under Windows to update the firmware.
de: Der Update-Modus wurde erfolgreich aktiviert. Bitte führen Sie das Nitrokey Update Tool unter Windows aus, um die Firmware zu aktualisieren.

source: This tool will activate the update mode on a Nitrokey Storage device. It is recommended for Windows 10 1809 users, where the device is not detected by the Nitrokey App, making the update mode activation not possible.
de: Dieses Tool aktiviert den Update-Modus auf einem Nitrokey Storage-Gerät. Es wird für Benutzer von Windows 10 1809 empfohlen, bei denen das Gerät nicht von der Nitrokey App erkannt wird, so dass die Aktivierung des Update-Modus nicht möglich ist.

source: Please do not remove the flash memory stick for the time of the activation.
de: Bitte entfernen Sie den Flash-Speicherstick für die Zeit der Aktivierung nicht.

source: If you would like to exit before the device is inserted, please simply press power off switch on your computer, and remove the USB flash memory stick with the tool.
de: Wenn Sie das Gerät vor dem Einsetzen verlassen möchten, drücken Sie einfach den Ausschalter an Ihrem Computer, und entfernen Sie den USB-Flash-Speicherstick mit dem Tool.

source: Tool ready to work
de: Werkzeug einsatzbereit

source: Please insert Nitrokey Storage device to an empty USB slot
de: Bitte stecken Sie das Nitrokey-Speichergerät in einen freien USB-Steckplatz.

source: Device connected. Trying default password - "{}".
de: Gerät verbunden. Ich versuche das Standardpasswort - "{}"

source: Default firmware password has not worked.
de: Standard-Firmwarepasswort hat nicht funktioniert.

source: Please provide firmware update password, to switch the device into the update mode. The password will be displayed on the screen. This is not a PIN password. Its length is between 8 and 20 characters.
de: Bitte geben Sie das Passwort für das Firmware-Update an, um das Gerät in den Update-Modus zu versetzen. Das Passwort wird auf dem Bildschirm angezeigt. Dies ist kein PIN-Passwort. Seine Länge beträgt zwischen 8 und 20 Zeichen.

source: Firmware password:
de: Firmware-Passwort:

source: Invalid password. Please try again.
de: Ungültiges Passwort. Bitte versuchen Sie es noch einmal.
